<?php

namespace app\commands\Generator_helpers;

class Helper
{
    static $array_name = [
        "Секретный Проект Альфа", "Операция Лунная Тень", "Протокол Океанский Ветер", "Код Черный Лотос",
        "Досье Персей", "Загадка Аметистового Грифа", "Рубиновые Сны", "Миссия Галактический Шторм",
        "Чертежи Звездного Замка", "Секреты Исчезнувшего Артефакта", "Инквизиторский Доклад", "Тень Ледяного Меча",
        "Кодовое Имя Феникс", "Пленницы Звездного Леса", "Алмазный Путь", "Артефакт Хаоса", "Операция Гиперион",
        "Призрак Восточного Моря", "Агент Багровой Розы", "Лабиринт Теней", "Тайна Изгнанника", "Кристалл Лунного Пламени",
        "Отражение Звездного Света", "Кодовое Имя Меркурий", "Звездный Предел", "Протокол Черного Дракона",
        "Дневник Сокровищ Небес", "Авантюра Перезагрузки", "Информационный Водоворот", "Звездная Галактика", "Сотовые Загадки",
        "Легенда Огненного Крыла", "Шифр Янтарного Лабиринта", "Территория Высоких Технологий", "Инквизиторский Архив", "Кодовое Имя Сирин",
        "Магия Космической Тысячи", "Документ 404", "Тень Забытых Времен", "Артефакт Пурпурного Света",
        "Секреты Солнечного Круга", "Королевский Пакт", "Миссия Ночной Крови", "Хроники Звездного Потока", "Инквизиторский Ликвидатор",
        "Аномалия Космической Пустоты", "Шифр Затерянного Легиона", "Доклад Псионической Энергии", "Секреты Звездного Моря",
        "Инструкция Портала Времени"
    ];
    static $array_theme = [
        "Искусственный интеллект и будущее человечества", "Экологические вызовы в современном мире", "История развития космических исследований",
        "Глобальные тенденции в медицине", "Цифровая трансформация бизнеса", "Роль женщин в современном обществе",
        "Технологии будущего: от киберпанка до реальности", "Финансовая устойчивость в условиях неопределенности", "Искусство и культура в эпоху глобализации",
        "Психология счастья и благополучия", "Модернизация городской инфраструктуры", "Здоровый образ жизни и профилактика заболеваний",
        "Этика и права животных", "Инновации в образовании: вызовы и перспективы", "Исследование человеческого мозга: достижения и перспективы",
        "Тайны древних цивилизаций", "Развитие туризма в XXI веке", "Интернет вещей: перспективы применения",
        "Борьба с климатическими изменениями", "Социальная ответственность бизнеса", "Криптовалюты и будущее финансовых рынков",
        "Роль и влияние медиа в современном обществе", "Индустрия развлечений и культурные стереотипы", "Новые технологии в сфере медицины",
        "История искусства: взгляд из современности", "Роботизация труда: вызовы и возможности", "Кризисы и управление рисками в бизнесе",
        "Экономическое развитие в посткоронавирусный период", "Права человека в цифровую эпоху", "Автоматизация и искусственный интеллект",
        "История индустриальной революции", "Роль гендера в обществе и бизнесе", "Теории общественного развития",
        "Культурное многообразие и единство", "Энергетическая безопасность и альтернативные источники энергии", "История медицины и медицинские открытия",
        "Интерактивные технологии в образовании", "Религия и современность: диалог культур", "Цифровая безопасность и угрозы интернета",
        "Исследование мегаполисов и урбанистика", "Инновации в секторе питания и сельском хозяйстве", "Футуристические технологии и общество завтрашнего дня",
        "Экологическая устойчивость и возобновляемые ресурсы", "История и философия науки", "Международные конфликты и дипломатия",
        "Технологии блокчейн и криптовалют","Семейные ценности и современное поколение", "Инфляция и монетарная политика",
        "Искусство кино: история и современность", "Исследование космической бездны и других миров"
    ];
    static $array_keywords = [
        "Исследование", "Анализ", "Стратегия", "Развитие", "Инновации", "Технологии", "Устойчивость",
        "Эффективность", "Конкуренция", "Качество", "Цифровизация", "Экосистема", "Глобализация", "Трансформация", "Импакт",
        "Диверсификация", "Автоматизация", "Адаптация", "Экология", "Интеграция", "Клиентоориентированность", "Инклюзивность",
        "Безопасность", "Инфраструктура", "Лидерство", "Партнерство", "Эксперимент", "Социальная ответственность",
        "Монетизация", "Цифровая трансформация", "Экспансия", "Аналитика", "Кооперация", "Маркетинг", "Индустриализация",
        "Финансы", "Ответственность", "Дивиденды", "Управление", "Предпринимательство", "Потребитель", "Инженерия",
        "Коммуникации", "Инклюзивный рост", "Интерактивность", "Креативность", "Риски", "Энергия", "Урбанизация",
        "Экосистемная экономика"
    ];
}