site_yii/views/docs-out/index.php

        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'summary' => false,
        'columns' => [

            ['attribute' => 'document_number','label' => '№ п/п', 'value' => function($model){
                if ($model->document_postfix == null)
                    return $model->document_number;
                else
                    return $model->document_number.'/'.$model->document_postfix;
            }],
            ['attribute' => 'document_date','label' => 'Дата документа'],
            ['attribute' => 'document_theme','label' => 'Тема документа'],
            ['attribute' => 'positionCompany','label' => 'Кому адресован', 'value' => function ($model) {
                if ($model->position_id == 7)
                    return $model->company->name;
                return $model->position ? $model->position->name.' '.$model->company->name: " ";
               // return $model->position->name.' '.$model->company->name;
            },
            ],
            ['attribute' => 'signedName','label' => 'Кем подписан', 'value' => function ($model) {
                //return $model->signed->secondname.' '.mb_substr($model->signed->firstname, 0, 1).'.'.mb_substr($model->signed->patronymic, 0, 1).'.';
                return $model->signed ? $model->signed->secondname.' '.mb_substr($model->signed->firstname, 0, 1).'.'.mb_substr($model->signed->patronymic, 0, 1).'.': " ";
            },
---
SELECT * FROM `company` WHERE `id` IN (25, 63)
SELECT * FROM `position` WHERE `id` IN (13, 124)