site_yii/views/journal/index.php

//bfbf
    $parts = \app\models\work\TrainingGroupParticipantWork::find()->joinWith(['participant participant'])->where(['training_group_id' => $model->trainingGroup])->orderBy(['participant.secondname' => SORT_ASC, 'participant.firstname' => SORT_ASC, 'participant.patronymic' => SORT_ASC])->all();
    $lessons = \app\models\work\TrainingGroupLessonWork::find()->where(['training_group_id' => $model->trainingGroup])->orderBy(['lesson_date' => SORT_ASC, 'id' => SORT_ASC])->all();
    $user = UserWork::find()->where(['id' => Yii::$app->user->identity->getId()])->one();
---
SELECT * FROM `user` WHERE `id`=1

        foreach ($lessons as $lesson)
        {
            //$visits = \app\models\work\VisitWork::find()->where(['training_group_lesson_id' => $lesson->id])->andWhere(['foreign_event_participant_id' => $part->participant->id])->one();
            $visits = \app\models\work\VisitWork::find()->where(['id' => $model->visits_id[$counter]])->one();
            echo $visits->prettyStatus;
            $counter++;
        }
        echo '<td style="text-align: left; ">'/*$part->groupProjectThemes ? $part->groupProjectThemes->projectTheme->name : ''*/.'</td>';
---
SELECT * FROM `visit` WHERE `id`=1483088
SELECT * FROM `group_project_themes` WHERE 0=1