site_yii/views/document-in/index.php

SELECT * FROM `company` WHERE `id` IN (8, 1)
SELECT * FROM `send_method` WHERE `id`=2
---
                else
                    return ['class' => 'warning'];
            },
            'columns' => [

                ['attribute' => 'fullNumber', 'label' => '№ п/п', 'value' => function($model){
                    if ($model->local_postfix == null)
                        return $model->local_number;
                    else
                        return $model->local_number.'/'.$model->local_postfix;
                }],
                ['attribute' => 'local_date', 'label' => 'Дата поступления<br>документа', 'encodeLabel' => false],
                ['attribute' => 'real_date', 'label' => 'Дата входящего<br>документа', 'encodeLabel' => false],
                ['attribute' => 'real_number', 'label' => 'Рег. номер<br>входящего док.', 'encodeLabel' => false],

                ['attribute' => 'companyName', 'label' => 'Наименование<br>корреспондента', 'encodeLabel' => false, 'value' => function ($model) {
                    return $model->company ? $model->company->name: '';
                }],
                ['attribute' => 'document_theme', 'label' => 'Тема документа', 'encodeLabel' => false],
                ['attribute' => 'sendMethodName','label' => 'Способ получения', 'value' => 'sendMethod.name'],
                ['attribute' => 'needAnswer', 'label' => 'Ответ', 'value' => function($model){
                   $links = \app\models\work\InOutDocsWork::find()->where(['document_in_id' => $model->id])->one();

