site_yii/controllers/DocsOutController.php

INSERT INTO `document_out` (`document_theme`, `document_name`, `document_date`, `sent_date`, `Scan`, `applications`, `creator_id`, `document_number`, `last_edit_id`) VALUES ('Резерв', '', '2024-04-25', '1999-01-01', '', '', 1, 4, 1)
---
    public function actionCreateReserve()
    {
        $model = new DocumentOutWork();
        $model->document_theme = 'Резерв';
        $model->document_name = '';
        //$model->document_date = end(DocumentOutWork::find()->orderBy(['document_number' => SORT_ASC, 'document_postfix' => SORT_ASC])->all())->document_date;
        $model->document_date = date("Y-m-d");
        $model->sent_date = '1999-01-01';
        $model->Scan = '';
        $model->applications = '';
        $model->creator_id = Yii::$app->user->identity->getId();
        $model->getDocumentNumber();
        Yii::$app->session->addFlash('success', 'Резерв успешно добавлен');
        $model->save(false);